#= ==========================================================================================
=============================================================================================
params
=============================================================================================
========================================================================================== =#

# space
xlims = (-15, 15); # μm
ylims = (-30, 30); # μm
walledDimensions = [1,2];

# fluid
viscosity = 1; # (μm)²/(μs)
isFluidCompressible = true;

# particle
radius = 1.0; # μm
position_1 = [0,1.5]; # μm
position_2 = [0,-1.5]; # μm
coupleTorques = false;
coupleForces = true;
angularVelocity = 1e-6; # rad/μs

# simulation
simulationTime = 10e3; # μs
ticksSaved = 100;
